import {
  Header,
  TermsList,
  TermsList2,
  TermsList3,
  TermsList4,
  TermsListItem,
  TermsListItem2,
  TermsListItem3,
  TermsListItem4,
} from './terms.styled';

interface TermsProp {
  text: 'Правила пользования' | 'Договор оферты';
}

export const Terms = ({ text }: TermsProp) => (
  <>
    <Header>{text}</Header>
    <TermsList>
      <TermsListItem>
        Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
        интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
        <TermsList2>
          <TermsListItem2>
            Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </TermsListItem2>
          <TermsListItem2>
            Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную
            роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь
            добавляют фракционных разногласий и преданы социально-демократической анафеме.
          </TermsListItem2>
          <TermsListItem2>
            Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
            экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.{' '}
          </TermsListItem2>
          <TermsListItem2>
            Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.{' '}
          </TermsListItem2>
        </TermsList2>
      </TermsListItem>

      <TermsListItem>
        С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие возможности
        для приоритизации разума над эмоциями.
        <TermsList2>
          <TermsListItem2>
            Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </TermsListItem2>
          <TermsList3>
            <TermsListItem3>
              Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную
              роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь
              добавляют фракционных разногласий и преданы социально-демократической анафеме.
            </TermsListItem3>
            <TermsListItem3>
              Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
              экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
            </TermsListItem3>
          </TermsList3>
          <TermsListItem2>
            Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </TermsListItem2>
        </TermsList2>
      </TermsListItem>

      <TermsListItem>
        Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас анализа
        приоритизации разума над эмоциями.
        <TermsList2>
          <TermsListItem2>
            Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </TermsListItem2>
          <TermsList3>
            <TermsListItem3>
              Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную
              роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь
              добавляют фракционных разногласий и преданы социально-демократической анафеме.
            </TermsListItem3>
            <TermsListItem3>
              Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
              экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
            </TermsListItem3>
          </TermsList3>
          <TermsListItem2>
            Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </TermsListItem2>
          <TermsListItem2>
            Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа
            существующих паттернов поведения.
          </TermsListItem2>
          <TermsList3>
            <TermsListItem3>
              А ещё представители современных социальных резервов набирают популярность среди определенных слоев
              населения, а значит, должны быть функционально разнесены на независимые элементы.
            </TermsListItem3>
            <TermsList4>
              <TermsListItem4>
                Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены нарушающими
                общечеловеческие нормы этики и морали.
              </TermsListItem4>
              <TermsListItem4>
                Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно фиксирует
                необходимость новых предложений. Являясь всего лишь частью общей картины, независимые государства
                представлены в исключительно положительном свете.
              </TermsListItem4>
            </TermsList4>
          </TermsList3>
          <TermsListItem2>
            Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа распределения
            внутренних резервов и ресурсов.
          </TermsListItem2>
        </TermsList2>
      </TermsListItem>
    </TermsList>
  </>
);
